<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Product::insert([
            [
                'name' => 'iPhone 13',
                'img' => 'images/13.jpg',
                'category_id' => 1,
                'preview' => 'Невероятно яркий дисплей в прочном корпусе. Режим «Киноэффект», который делает из вашего видео настоящее кино. Супербыстрый чип. И неутомимый аккумулятор.',
                'description' => 'iPhone 13 является базовой моделью 15-го поколения. Содержит процессор Apple A15 в котором 15 млрд транзисторов. Самая совершенная система двух камер на iPhone. Режим «Киноэффект» делает из видео настоящее кино. Супербыстрый чип A15 Bionic. Неутомимый аккумулятор. Прочный корпус. И ещё более яркий дисплей Super Retina XDR.',
                'price' => 85990,
            ],
            [
                'name' => 'iPhone SE 2020',
                'img' => 'images/se.png',
                'category_id' => 1,
                'preview' => 'Смартфон имеет компактные габариты, который также получил влагозащиту по стандарту IP67.',
                'description' => 'iPhone SE — это самый мощный компактный iPhone1 с множеством передовых технологий. A13 Bionic — самый быстрый процессор для iPhone, обеспечивающий максимальную производительность для приложений, игр и фотосъёмки. Портретный режим и шесть эффектов освещения для фотографий студийного качества. Технология Smart HDR нового поколения для невероятной детализации даже в светлых и тёмных областях кадра. Видео 4K кинематографического качества. И самые продвинутые функции iOS. Долгое время работы без подзарядки2 и защита от воды3 — всё, за что вы любите iPhone, в удивительно компактном корпусе.',
                'price' => 36990,
            ],
            [
                'name' => 'Macbook Pro',
                'img' => 'images/mac.png',
                'category_id' => 2,
                'preview' => 'Дисплей с диагональю 13,3 дюйма, подсветкой LED и технологией IPS; разрешение 2560×1600 пикселей (227 пикселей на дюйм)',
                'description' => '13-дюймовый ноутбук MacBook Pro получил обновленную конструкцию, более мощный графический контроллер от Nvidia, интерфейс DisplayPort, тачпад с поддержкой технологии MultiTouch (поддерживает одновременно несколько нажатий и распознает жесты), а также обновленный внешний вид, благодаря которому они стали похожи на MacBook Pro. За счет новой конструкции, очередное поколение мобильных компьютеров MacBook стало прочнее и устойчивее к крутильной деформации, в то время как толщина корпуса составляет 2,4 см, а вес 2 кг. Все разъемы располагаются на левой стороне. Здесь же размещен светодиодный индикатор заряда батареи. Благодаря изменению конструкции можно получить доступ к жесткому диску, всего лишь вынув батарею. Изменения коснулись и графической подсистемы: встроенный контроллер Intel сменила Nvidia GeForce 9400M с 16 вычислительными ядрами, которая, в зависимости от приложения, обеспечивает пятикратный прирост мощности по сравнению с предыдущими ноутбуками. Тачпад ноутбука увеличен на 39%, теперь он может распознавать жесты и поддерживает виртуальные программные кнопки.',
                'price' => 189990,
            ],
            [
                'name' => 'AirPods 3',
                'img' => 'images/pods.jpg',
                'category_id' => 5,
                'preview' => 'Динамический драйвер, разработанный Apple, использует специальный усилитель, обеспечивая невероятную детальность звучания.',
                'description' => 'Компания Apple выпустила достойное продолжение своей линейки беспроводных наушников, радикально изменив дизайн, оснастив новинку технологиями, дебютировавшими в AirPods Pro (за исключением шумоподавления, конечно), и увеличив продолжительность работы от одного заряда. Вдобавок, улучшился и звук, хотя возможно, что причиной тому как раз изменение формы наушников, поскольку они теперь глубже располагаются в ушных раковинах.',
                'price' => 17999,
            ],
            [
                'name' => 'iPhone 12',
                'img' => 'images/12.jpg',
                'category_id' => 1,
                'preview' => 'Пиковая яркость 1200 нит. Экран покрыт керамическим покрытием Ceramic Shield, произведённым совместно с компанией Corning.',
                'description' => 'Это iPhone 12. Великолепный яркий дисплей Super Retina XDR 6,1 дюйма.1 Передняя панель Ceramic Shield, с которой риск повреждений дисплея при падении в 4 раза ниже.2 Потрясающее качество снимков при слабом освещении благодаря Ночному режиму на всех камерах. Съёмка, монтаж и воспроизведение видео кинематографического качества в стандарте Dolby Vision. Мощный процессор A14 Bionic. И новые аксессуары MagSafe, которые мгновенно примагничиваются и обеспечивают более быструю беспроводную зарядку.3 Другими словами, вас ждут яркие открытия.',
                'price' => 59999,
            ],
            [
                'name' => 'iPhone 12 Pro',
                'img' => 'images/12pro.jpg',
                'category_id' => 1,
                'preview' => 'A14 Bionic, самый быстрый процессор iPhone. И система камер Pro, которая гораздо лучше работает при слабом освещении',
                'description' => 'Это iPhone 12 Pro. Великолепный яркий дисплей Super Retina XDR 6,1 дюйма.1 Передняя панель Ceramic Shield, с которой риск повреждений дисплея при падении в 4 раза ниже.2 Потрясающее качество снимков при слабом освещении благодаря новой системе камер Pro. Оптический зум с диапазоном 4x. Съёмка, монтаж и воспроизведение видео кинематографического качества в стандарте Dolby Vision. Ночной режим для портретов и дополненная реальность нового уровня благодаря сканеру LiDAR. Мощный процессор A14 Bionic. И новые аксессуары MagSafe, которые мгновенно примагничиваются и обеспечивают более быструю беспроводную зарядку.3 Это впечатляющие возможности. ',
                'price' => 69999,
            ],
        ]);
    }
}
